In [1]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\shampa\anaconda3\envs\pythondata\lib\site-packages (1.3.18)

WARNING: You are using pip version 20.2.3; however, version 20.2.4 is available.
You should consider upgrading via the 'c:\users\shampa\anaconda3\envs\pythondata\python.exe -m pip install --upgrade pip' command.

In [28]:
%matplotlib inline
from matplotlib import style
style.use('fivethirtyeight')
import matplotlib.pyplot as plt

In [29]:
import numpy as np
import pandas as pd

In [30]:
import datetime as dt

# Reflect Tables into SQLAlchemy ORM

In [31]:
# Python SQL toolkit and Object Relational Mapper
import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, func
from sqlalchemy import create_engine

In [35]:
engine = create_engine("sqlite:///Resources/hawaii.sqlite")

In [36]:
Base = automap_base()

In [37]:
Base.prepare(engine, reflect=True)

In [38]:
Base.classes.keys()

['measurement', 'station']

In [39]:
Measurement = Base.classes.measurement
Station = Base.classes.station

In [40]:
#Create a session
session = Session(engine)

In [41]:
#Display row's columns and data in dictionary format for Measurement
first_row = session.query(Measurement).first()
first_row.__dict__

{'_sa_instance_state': <sqlalchemy.orm.state.InstanceState at 0x2074358c160>,
 'prcp': 0.08,
 'station': 'USC00519397',
 'tobs': 65.0,
 'date': '2010-01-01',
 'id': 1}

In [43]:
#Use Session to query Measurement Table 

for row in session.query(Measurement.id, Measurement.date, Measurement.tobs, Measurement.station, Measurement.prcp).limit(15).all():
    print(row)

(1, '2010-01-01', 65.0, 'USC00519397', 0.08)
(2, '2010-01-02', 63.0, 'USC00519397', 0.0)
(3, '2010-01-03', 74.0, 'USC00519397', 0.0)
(4, '2010-01-04', 76.0, 'USC00519397', 0.0)
(5, '2010-01-06', 73.0, 'USC00519397', None)
(6, '2010-01-07', 70.0, 'USC00519397', 0.06)
(7, '2010-01-08', 64.0, 'USC00519397', 0.0)
(8, '2010-01-09', 68.0, 'USC00519397', 0.0)
(9, '2010-01-10', 73.0, 'USC00519397', 0.0)
(10, '2010-01-11', 64.0, 'USC00519397', 0.01)
(11, '2010-01-12', 61.0, 'USC00519397', 0.0)
(12, '2010-01-14', 66.0, 'USC00519397', 0.0)
(13, '2010-01-15', 65.0, 'USC00519397', 0.0)
(14, '2010-01-16', 68.0, 'USC00519397', 0.0)
(15, '2010-01-17', 64.0, 'USC00519397', 0.0)

In [42]:
#Display row's columns and data in dictionary format for Station
first_row = session.query(Station).first()
first_row.__dict__

{'_sa_instance_state': <sqlalchemy.orm.state.InstanceState at 0x2074358c630>,
 'longitude': -157.8168,
 'name': 'WAIKIKI 717.2, HI US',
 'station': 'USC00519397',
 'elevation': 3.0,
 'latitude': 21.2716,
 'id': 1}

In [45]:
#Use Session to query Station Table 
for row in session.query(Station.id, Station.station, Station.name, Station.longitude, Station.elevation, Station.latitude).limit(15).all():
    print(row)

(1, 'USC00519397', 'WAIKIKI 717.2, HI US', -157.8168, 3.0, 21.2716)
(2, 'USC00513117', 'KANEOHE 838.1, HI US', -157.8015, 14.6, 21.4234)
(3, 'USC00514830', 'KUALOA RANCH HEADQUARTERS 886.9, HI US', -157.8374, 7.0, 21.5213)
(4, 'USC00517948', 'PEARL CITY, HI US', -157.9751, 11.9, 21.3934)
(5, 'USC00518838', 'UPPER WAHIAWA 874.3, HI US', -158.0111, 306.6, 21.4992)
(6, 'USC00519523', 'WAIMANALO EXPERIMENTAL FARM, HI US', -157.71139, 19.5, 21.33556)
(7, 'USC00519281', 'WAIHEE 837.5, HI US', -157.84888999999998, 32.9, 21.45167)
(8, 'USC00511918', 'HONOLULU OBSERVATORY 702.2, HI US', -157.9992, 0.9, 21.3152)
(9, 'USC00516128', 'MANOA LYON ARBO 785.2, HI US', -157.8025, 152.4, 21.3331)

In [46]:
conn = engine.connect()

In [54]:
measurement_data = pd.read_sql(sql="SELECT * FROM measurement", con=conn)

In [55]:
measurement_data.head()

   id      station        date  prcp  tobs
0   1  USC00519397  2010-01-01  0.08  65.0
1   2  USC00519397  2010-01-02  0.00  63.0
2   3  USC00519397  2010-01-03  0.00  74.0
3   4  USC00519397  2010-01-04  0.00  76.0
4   5  USC00519397  2010-01-06   NaN  73.0

In [56]:
station_data = pd.read_sql(sql="SELECT * FROM station", con=conn)

In [53]:
station_data.head()

,id,station,name,latitude,longitude,elevation
0,1,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0
1,2,USC00513117,"KANEOHE 838.1, HI US",21.4234,-157.8015,14.6
2,3,USC00514830,"KUALOA RANCH HEADQUARTERS 886.9, HI US",21.5213,-157.8374,7.0
3,4,USC00517948,"PEARL CITY, HI US",21.3934,-157.9751,11.9
4,5,USC00518838,"UPPER WAHIAWA 874.3, HI US",21.4992,-158.0111,306.6

In [57]:
combined_data = pd.merge(left=station_data,
                        right=measurement_data,
                        on="station")

In [58]:
combined_data

,id_x,station,name,latitude,longitude,elevation,id_y,date,prcp,tobs
0,1,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0,1,2010-01-01,0.08,65.0
1,1,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0,2,2010-01-02,0.00,63.0
2,1,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0,3,2010-01-03,0.00,74.0
3,1,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0,4,2010-01-04,0.00,76.0
4,1,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0,5,2010-01-06,NaN,73.0
...,...,...,...,...,...,...,...,...,...,...
19545,9,USC00516128,"MANOA LYON ARBO 785.2, HI US",21.3331,-157.8025,152.4,19546,2017-08-19,0.09,71.0
19546,9,USC00516128,"MANOA LYON ARBO 785.2, HI US",21.3331,-157.8025,152.4,19547,2017-08-20,NaN,78.0
19547,9,USC00516128,"MANOA LYON ARBO 785.2, HI US",21.3331,-157.8025,152.4,19548,2017-08-21,0.56,76.0
19548,9,USC00516128,"MANOA LYON ARBO 785.2, HI US",21.3331,-157.8025,152.4,19549,2017-08-22,0.50,76.0
19549,9,USC00516128,"MANOA LYON ARBO 785.2, HI US",21.3331,-157.8025,152.4,19550,2017-08-23,0.45,76.0

In [ ]:
# reflect an existing database into a new model

# reflect the tables

In [ ]:
# We can view all of the classes that automap found

In [ ]:
# Save references to each table

In [ ]:
# Create our session (link) from Python to the DB

# Exploratory Climate Analysis

In [ ]:
# Design a query to retrieve the last 12 months of precipitation data and plot the results

# Calculate the date 1 year ago from the last data point in the database

# Perform a query to retrieve the data and precipitation scores

# Save the query results as a Pandas DataFrame and set the index to the date column

# Sort the dataframe by date

# Use Pandas Plotting with Matplotlib to plot the data

In [ ]:
# Use Pandas to calcualte the summary statistics for the precipitation data

In [ ]:
# Design a query to show how many stations are available in this dataset?

In [ ]:
# What are the most active stations? (i.e. what stations have the most rows)?
# List the stations and the counts in descending order.

In [ ]:
# Using the station id from the previous query, calculate the lowest temperature recorded, 
# highest temperature recorded, and average temperature of the most active station?

In [ ]:
# Choose the station with the highest number of temperature observations.
# Query the last 12 months of temperature observation data for this station and plot the results as a histogram

## Bonus Challenge Assignment

In [ ]:
# This function called `calc_temps` will accept start date and end date in the format '%Y-%m-%d' 
# and return the minimum, average, and maximum temperatures for that range of dates
def calc_temps(start_date, end_date):
    """TMIN, TAVG, and TMAX for a list of dates.
    
    Args:
        start_date (string): A date string in the format %Y-%m-%d
        end_date (string): A date string in the format %Y-%m-%d
        
    Returns:
        TMIN, TAVE, and TMAX
    """
    
    return session.query(func.min(Measurement.tobs), func.avg(Measurement.tobs), func.max(Measurement.tobs)).\
        filter(Measurement.date >= start_date).filter(Measurement.date <= end_date).all()

# function usage example
print(calc_temps('2012-02-28', '2012-03-05'))

In [ ]:
# Use your previous function `calc_temps` to calculate the tmin, tavg, and tmax 
# for your trip using the previous year's data for those same dates.

In [ ]:
# Plot the results from your previous query as a bar chart. 
# Use "Trip Avg Temp" as your Title
# Use the average temperature for the y value
# Use the peak-to-peak (tmax-tmin) value as the y error bar (yerr)

In [ ]:
# Calculate the total amount of rainfall per weather station for your trip dates using the previous year's matching dates.
# Sort this in descending order by precipitation amount and list the station, name, latitude, longitude, and elevation

In [ ]:
# Create a query that will calculate the daily normals 
# (i.e. the averages for tmin, tmax, and tavg for all historic data matching a specific month and day)

def daily_normals(date):
    """Daily Normals.
    
    Args:
        date (str): A date string in the format '%m-%d'
        
    Returns:
        A list of tuples containing the daily normals, tmin, tavg, and tmax
    
    """
    
    sel = [func.min(Measurement.tobs), func.avg(Measurement.tobs), func.max(Measurement.tobs)]
    return session.query(*sel).filter(func.strftime("%m-%d", Measurement.date) == date).all()
    
daily_normals("01-01")

In [ ]:
# calculate the daily normals for your trip
# push each tuple of calculations into a list called `normals`

# Set the start and end date of the trip

# Use the start and end date to create a range of dates

# Stip off the year and save a list of %m-%d strings

# Loop through the list of %m-%d strings and calculate the normals for each date

In [ ]:
# Load the previous query results into a Pandas DataFrame and add the `trip_dates` range as the `date` index

In [ ]:
# Plot the daily normals as an area plot with `stacked=False`